Repository: Lemkinator/portfolio
Catalog: lib/l10n/intl_*.arb
Languages: de

source: Hello World!
de: Hallo Welt!

# hello
source: Hello {userName}
de: Hallo {userName}

# colorBlue
source: Blue
de: Blau

# colorTeal
source: Teal
de: Türkis

# colorGreen
source: Green
de: Grün

# colorYellow
source: Yellow
de: Gelb

# colorDeepOrange
source: Deep Orange
de: Dunkel Orange

source: Select a seed color
de: Farbe auswählen

source: Toggle light
de: Hell/Dunkel

source: Light
de: Hell

# mySlogan
source: "Those looking for quick success should not program, but chop wood."
de: "Wer den schnellen Erfolg sucht, sollte nicht programmieren, sondern Holz hacken."

# myDescription
source: Hello, my name is Leonard. Besides my passion for technology, smartphones, Android and computer games, I like to program apps for Android in OneUI style or edit videos that I record with my racing drone.
de: Hallo, mein Name ist Leonard. Neben meiner Leidenschaft für Technik, Smartphones, Android und Computerspiele, programmiere ich gerne Apps für Android im OneUI-Stil oder bearbeite Videos, die ich mit meiner Racing-Drohne aufnehme.

source: Apprenticeship
de: Ausbildung

# apprenticeshipDate
source: September 2019 - July 2021
de: September 2019 - Juli 2021

# study
source: Study: Bachelor of Science
de: Studium: Bachelor of Science

# studyDate
source: September 2019 - February 2024
de: September 2019 - Februar 2024

# studySpecialization
source: General Computer Science (Specialization Software Engineering)
de: Allgemeine Informatik (Vertiefungsrichtung Software Engineering)

# sudokuDescription
source: A Sudoku app with OneUI-Design.
de: Eine Sudoku App im schönen OneUI-Design.

# studiportalDescription
source: The new Studiportal app with OneUI-Design.
de: Die neue Studiportal-App mit OneUI-Design.

# nakBuchDescription
source: The new non-official songbook app of the New Apostolic Church.
de: Die neue nicht-offizielle Liederbuch-App der Neuapostolischen Kirche.

source: Game
de: Spiel

# appsDescription
source: Modern Apps in Samsungs OneUI-Style.
de: Moderne Apps in Samsungs OneUI-Style.

source: Projects
de: Projekte

source: All Projects
de: Alle Projekte

# whatIsFpv
source: What is Cinematic/Freestyle FPV?
de: Was ist Cinematic/Freestyle FPV?

# whatIsFpv1
source: First-person view (FPV) is a method where a radio-controlled aircraft (drone) is piloted remotely from a first-person perspective via an onboard camera, fed wirelessly to video FPV goggles.
de: First-Person-View (FPV) ist eine Methode, bei der ein funkgesteuertes Fluggerät (Drohne) aus der Ich-Perspektive über eine Bordkamera ferngesteuert wird, die drahtlos an eine FPV-Videobrille übertragen wird.

# whatIsFpv2
source: Freestyle FPV is all about flying skills and doing nice tricks or movements.
de: Bei Freestyle FPV geht es um Flugkünste und schöne Tricks oder Bewegungen.

# whatIsFpv3
source: Cinematic FPV content tends to be slower and smoother than Freestyle FPV. The settings are chosen more for their visual attraction than for the technical flying skills they demand.
de: Cinematic FPV ist tendenziell langsamer und flüssiger als Freestyle FPV. Die Einstellungen werden eher wegen ihres visuellen Reizes gewählt als wegen der technischen Flugfähigkeiten, die sie erfordern.

source: What is special about FPV?
de: Was ist das Besondere an FPV?

# whatIsSpecialAboutFpv1
source: The difference to normal drone pilots is that FPV pilots mostly build their drone(s) themselves.
de: Der Unterschied zu normalen Drohnenpiloten ist, dass FPV-Piloten ihre Drohne(n) meist selbst bauen.

# whatIsSpecialAboutFpv2
source: This includes:
de: Dies beinhaltet:

# whatIsSpecialAboutFpv3
source: Search and buy parts
de: Teile suchen und kaufen

# whatIsSpecialAboutFpv4
source: Assembling the drone
de: Zusammenbau der Drohne

# whatIsSpecialAboutFpv5
source: Setting up the drone (Software)
de: Einrichten der Drohne (Software)

# whatIsSpecialAboutFpv6
source: Furthermore, it requires much more practice, since FPV drones are usually flown in acro mode (acrobatic mode: e.g. when releasing the control sticks, the drone does not automatically level itself or if you move the sticks forward, the drone will pitch forward continuously instead of accelerating forward...).
de: Außerdem erfordert es viel mehr Übung, da FPV-Drohnen in der Regel im Akro-Modus geflogen werden (Akrobatik-Modus: z.B. wenn man die Steuerknüppel loslässt, bewegt sich die Drohne nicht automatisch wieder in ihre Ausgangsposition, oder wenn man die Knüppel nach vorne bewegt, neigt sich die Drohne kontinuierlich nach vorne, anstatt nach vorne zu beschleunigen...).

# whatIsSpecialAboutFpv7
source: But the practice is worth it, because flying FPV is incredibly fun!
de: Aber die Übung ist es wert, denn FPV-Fliegen macht unglaublich viel Spaß!

source: What got me into FPV?
de: Was hat mich zu FPV gebracht?

# journey1
source: The journey began with a normal consumer drone...
de: Die Reise begann mit einer normalen Verbraucherdrohne...

# journey2
source: ... but ended very early with a broken drone and the fact, that its nearly impossible to repair those drones by your own.
de: ... endete aber sehr früh mit einer kaputten Drohne und der Tatsache, dass dass es fast unmöglich ist, diese Drohnen selbst zu reparieren.

# journey3
source: Since the repair at the manufacturer is quite expensive, i decided to build a drone myself... Which turned out not to be cheaper...
de: Da die Reparatur beim Hersteller teuer ist, habe ich mich entschlossen, selbst eine Drohne zu bauen... Was sich als nicht billiger erwies...

# journey4
source: After researching for the needed parts, the assembly began.
de: Nach der Suche nach den benötigten Teilen begann der Zusammenbau.

# journey5
source: Assembling and wiring...
de: Zusammenbau und Verkabelung...

# journey6
source: Getting the Hardware ready...
de: Vorbereitungen für die Hardware...

# journey7
source: Setup and configuration of the software...
de: Einrichtung und Konfiguration der Software...

# journey8
source: Done!
de: Fertig!

# journey9
source: Well (after a few encounters with the snowy ground)... seems a lot more durable than the drone before...
de: Nun (nach ein paar Begegnungen mit dem schneebedeckten Boden)... scheint robuster als die alte Drohne...

source: Privacy Policy
de: Datenschutzerklärung

source: Other Features
de: Sonstige Features

source: Free
de: Kostenlos

# windows11Support1
source: To use mobile apps on a Windows 11 PC, the
de: Um mobile Apps auf einem Windows 11 PC nutzen zu können, muss der

# windows11Support4
source: must be installed.
de: installiert werden.

# windows11Support5
source: https://support.microsoft.com/en-us/topic/f8d0abb5-44ad-47d8-b9fb-ad6b1459ff6c
de: https://support.microsoft.com/de-de/windows/installieren-mobiler-apps-und-der-amazon-appstore-unter-windows-f8d0abb5-44ad-47d8-b9fb-ad6b1459ff6c

# windows11Support6
source: Install Amazon Appstore on Windows 11
de: Amazon Appstore in Windows 11 installieren

# nakBuchDisclaimer
source: This app is in no way affiliated with the New Apostolic Church or Verlag Friedrich Bischoff GmbH and contains only the copyright-free texts from the following books:
de: Diese App steht in keiner Verbindung zur Neuapostolischen Kirche oder der Verlag Friedrich Bischoff GmbH und beinhaltet lediglich die urheberrechtsfreien Texte aus dem folgenden Büchern:

# nakBuchDisclaimer1
source: Gesangbuch (320 of 438 songs)
de: Gesangbuch (320 von 438 Liedern)

# nakBuchDisclaimer2
source: Chorbuch (207 of 462 songs)
de: Chorbuch (207 von 462 Liedern)

# nakBuchDisclaimer3
source: Jugendliederbuch (41 of 102 songs)
de: Jugendliederbuch (41 von 102 Liedern)

# nakBuchDisclaimer4
source: Ergänzungsheft zum Jugendliederbuch (3 of 20 songs)
de: Ergänzungsheft zum Jugendliederbuch (3 von 20 Liedern)

# nakBuchDisclaimer5
source: For the remaining songs, the rights are still held by the authors, which is why they cannot be displayed or can only be displayed in part. The information on copyright has been checked with great care. If I have unwittingly made mistakes, please let me know and I will follow up immediately.
de: Bei den restlichen Liedern liegen die Rechte noch bei den Urhebern, weshalb diese nicht oder nur teilweise angezeigt werden können. Die Informationen zum Urheberrecht wurden mit großer Sorgfalt geprüft, wenn mir hierbei unwissend Fehler unterlaufen sind, bitte ich freundlichst um einen Hinweis, dem ich unverzüglich nachgehen werde.

# nakBuchDisclaimer6
source: The administration of the rights is, among others, the responsibility of Verlag Friedrich Bischoff GmbH, which has itself published a (paid) app for the Gesangbuch and a (paid) app for the Chorbuch.
de: Die Verwaltung der Rechte obliegt u.a. der Verlag Friedrich Bischoff GmbH, welche selbst eine (kostenpflichtige) App für das Gesangbuch und eine (kostenpflichtige) App für das Chorbuch herausgegeben hat.

source: Dark Mode (automatically adapts to the system settings)
de: Dark Mode (passt sich automatisch den Systemeinstellungen an)

# nakBuchQuickSettingForMutedoNotDisturbMode
source: Quick setting for mute/do not disturb mode
de: chnell-Einstellung für Stummschalten/Bitte-Nicht-Stören-Modus

# nakBuchPleasantTextView
source: Pleasant text view
de: Angenehme Textansicht

source: Favorites
de: Favoriten

source: Notes
de: Notizen

source: Date function (sung on...)
de: Datumsfunktion (Gesungen am...)

source: History
de: Verlauf

# wearOsSupportText
source: Forgotten your smartphone? No problem, the text contents of the app can be displayed on the smartwatch without any problems (in a pleasant design).
de: Smartphone vergessen? Kein Problem, die Textinhalte der App lassen sich Problemlos (in angenehmem Design) auf der Smartwatch anzeigen.

# nakBuchAmazonAppStoreLink
source: https://www.amazon.com/gp/product/B0BJ13C4RH
de: https://www.amazon.de/gp/product/B0BJ13C4RH

# nakBuchAmazonAppStore
source: NAK Buch in Amazon Appstore
de: NAK Buch im Amazon Appstore

# nakBuchOneUi
source: NAK Buch was developed according to Samsung's One UI guidelines. For example, the title bar can be "dragged down" on large devices on any screen to ensure comfortable (one-handed) operation of the top buttons.
de: Die App wurde nach Samsungs OneUI-Richtlinien entwickelt. Zum Beispiel kann die Titelleiste bei großen Geräten auf jedem Bildschirm "nach unten gezogen werden", um eine angenehme (einhändige) Bedienung der oberen Knöpfe zu gewährleisten.

# nakBuchSwipeSongs
source: Swipe Songs
de: Blätter-Funktion

# nakBuchSwipeSongsText
source: Swipe to go to the next/previous song. Just like a real book.
de: Wisch-Geste, um zum nächsten/vorherigen Lied zu gelangen. Wie bei einem richtigen Buch.

# nakBuchDataTabText
source: Your personal data at a glance.
de: Deine persönlichen Daten auf einen Blick.

# nakBuchShortcutsText
source: Don't like all books in one app? With NAK Buch you can create a shortcut for each book.
de: Alle Bücher in einer App ist unpraktisch? Für jedes Buch kann eine Verknüpfung erstellt werden.

# nakBuchQuickActions
source: Quick Actions
de: Schnelle Aktionen

# nakBuchQuickActionsText
source: To quickly mute your smartphone, activate Do Not Disturb mode or open the official app if the full lyrics cannot displayed.
de: Um das Smartphone schnell stumm zu schalten, den Bitte Nicht Stören Modus zu aktivieren oder die offizielle App zu öffnen, falls der vollständige Liedtext nicht angezeigt werden kann.

# provider
source: Provider/Operator
de: Anbieter/Betreiber

source: Privacy Information
de: Informationen zum Datenschutz

# PrivacyInformationNoDataCollected
source: The app does not collect or share user data.
de: Die App erhebt oder teilt keine Nutzerdaten.

source: Status of the data protection information
de: Stand der Datenschutzinformationen

# nakBuchStatusPrivacyInformation
source: We review our privacy information on a regular basis. We reserve the right to change the privacy notice at any time with or without notice. Please check back periodically to be notified of any changes. This statement was last updated on 04/19/2022.
de: Wir überprüfen unsere Datenschutzhinweise regelmäßig. Wir behalten uns das Recht vor, die Datenschutzerklärung jederzeit mit oder ohne vorherige Ankündigung zu ändern. Bitte schauen Sie regelmäßig vorbei, um über Änderungen informiert zu werden. Diese Aussage wurde zuletzt am 19.04.2022 aktualisiert.

# studiportalDisclaimer
source: This app is in no way affiliated with Furtwangen University and is only used to display the data from the Studiportal. The logo is used with the kind permission of the Strategy and Communication Department of Furtwangen University.
de: Diese App steht in keiner Verbindung zur Hochschule Furtwangen und dient lediglich dazu, die Daten aus dem Studiportal anzuzeigen. Die Nutzung des Logos erfolgt mit freundlicher Genehmigung der Strategie und Kommunikationsabteilung der Hochschule Furtwangen.

# studiportalAmazonAppStore
source: Studiportal in Amazon Appstore
de: Studiportal im Amazon Appstore

# studiportalAmazonAppStoreLink
source: https://www.amazon.com/gp/product/B0BW6HX7RG
de: https://www.amazon.de/gp/product/B0BW6HX7RG

# studiportalOneUi
source: Studiportal was developed according to Samsung's One UI guidelines. For example, the title bar can be "dragged down" on large devices on any screen to ensure comfortable (one-handed) operation of the top buttons.
de: Die App wurde nach Samsungs OneUI-Richtlinien entwickelt. Zum Beispiel kann die Titelleiste bei großen Geräten auf jedem Bildschirm "nach unten gezogen werden", um eine angenehme (einhändige) Bedienung der oberen Knöpfe zu gewährleisten.

source: Notifications
de: Benachrichtigungen

# studiportalNotifications
source: Receive a notification when changes occur in Studiportal.
de: Bei Änderungen im Studiportal eine Benachrichtiung erhalten.

# studiportalStatusPrivacyInformation
source: We review our privacy information on a regular basis. We reserve the right to change the privacy notice at any time with or without notice. Please check back periodically to be notified of any changes. This statement was last updated on 11/14/2022.
de: Wir überprüfen unsere Datenschutzhinweise regelmäßig. Wir behalten uns das Recht vor, die Datenschutzerklärung jederzeit mit oder ohne vorherige Ankündigung zu ändern. Bitte schauen Sie regelmäßig vorbei, um über Änderungen informiert zu werden. Diese Aussage wurde zuletzt am 14.11.2022 aktualisiert.

# sudokuText1
source: Sudoku fans listen up! Here is the ultimate app that will take your brain power to the next level. With thousands of sudokus in different levels of difficulty, there's something for everyone, from beginners to professionals. Numerous levels ensure ongoing fun and with the Google Play Games integration, you can unlock exciting achievements, compete with your friends and fight for a good rank in various leaderboards.
de: Sudoku-Fans aufgepasst! Hier ist die ultimative App, die eure Gehirnleistung auf die nächste Stufe bringen wird. Mit tausenden Rätseln in verschiedenen Schwierigkeitsgraden ist für jeden etwas dabei, vom Anfänger bis zum Profi. Zahlreiche Level sorgen für andauernden Spielspaß und durch die Google Play Spiele integration kannst du spannende Erfolge freischalten, dich mit deinen Freunden messen und dir einen guten Platz in verschiedenen Bestenlisten erkämpfen.

# sudokuText2
source: But that's not all! The app also offers daily challenges to keep you fit. You can easily track your progress with comprehensive statistics and with the possibility to play offline, you'll be ready to challenge your brain anytime, anywhere.
de: Aber das ist noch lange nicht alles! Die App bietet auch tägliche Herausforderungen, um dich fit zu halten. Deine Fortschritte kannst du mit umfangreichen Statistiken kinderleicht verfolgen und mit der Möglichkeit, offline zu spielen, bist du immer und überall bereit, dein Gehirn herauszufordern.

# sudokuText3
source: So what are you waiting for? Download the app from the Play Store now and let your brain shine!
de: Also worauf wartest du noch? Lade jetzt die App im Play Store herunter und lass dein Gehirn glänzen!

source: Statistics
de: Statistiken

# sudokuAmazonAppStore
source: Sudoku in Amazon Appstore
de: Sudoku im Amazon Appstore

# sudokuAmazonAppStoreLink
source: https://www.amazon.com/gp/product/B0BW6JPCB4
de: https://www.amazon.de/gp/product/B0BW6JPCB4

# sudokuOneUi
source: Sudoku was developed according to Samsung's One UI guidelines. For example, the title bar can be "dragged down" on large devices on any screen to ensure comfortable (one-handed) operation of the top buttons.
de: Die App wurde nach Samsungs OneUI-Richtlinien entwickelt. Zum Beispiel kann die Titelleiste bei großen Geräten auf jedem Bildschirm "nach unten gezogen werden", um eine angenehme (einhändige) Bedienung der oberen Knöpfe zu gewährleisten.

source: Google Play Games
de: Google Play Spiele

# googlePlayGamesText
source: With Google Play Games integration, you can unlock exciting achievements, compete with your friends and earn a good rank in various leaderboards.
de: Durch die Google Play Spiele integration kannst du spannende Erfolge freischalten, dich mit deinen Freunden messen und dir einen guten Platz in verschiedenen Bestenlisten erkämpfen.

# sudokuLevelText
source: Play Sudoku levels with increasing difficulty and track your level progress.
de: Spiele Sudoku Level mit steigendem Schwierigkeitsgrad und verfolge deinen Level-Fortschritt.

source: Daily Sudoku
de: Tägliches Sudoku

# dailySudokuText
source: Play Sudoku every day and track your daily progress.
de: Spiele jeden Tag Sudoku und verfolge deinen täglichen Fortschritt.

# sudokuPrivacyPolicy1
source: The data mentioned below is collected by
de: Die unten genannten Daten werden von

# sudokuPrivacyPolicy3
source: provided that the user logs in or has activated the automatic login.
de: sofern der Nutzer sich anmeldet oder die automatische Anmeldung aktiviert hat.

# sudokuPrivacyPolicy4
source: The Google Play Games services provide access for sign-in as well as services for game apps. Further settings, as well as the deletion of the data can be made in the Play Games profile.
de: Die Google Play-Dienste für Spiele stellen Zugriff für die Anmeldung sowie Dienste für Spiele-Apps bereit. Weitere Einstellungen, sowie die Löschung der Daten können im Play Spiele-Profil vorgenommen werden.

source: Play Games profile privacy & other settings
de: Datenschutz und andere Einstellungen für das Play Spiele-Profil

source: Delete your Play Games profile and data
de: Play Spiele-Profil und zugehörige Daten löschen

source: Data encryption
de: Datenverschlüsselung

# sudokuDataEncryption
source: For the collected end-user data listed on this page, Play Games Services encrypts the data in transit using HTTPS.
de: Für die gesammelten Endnutzerdaten, die auf dieser Seite aufgeführt sind, verschlüsselt Play Games Services die Daten während der Übertragung mit HTTPS.

source: Data collected
de: Erfasste Daten

# sudokuDataCollected
source: Gamer Identity (Gamertag, avatar), analytics and diagnostics data and app activities (e.g. achievements, scores).
de: Identität des Spielers (Gamertag, Avatar), Analyse- und Diagnose-Daten und App Aktivitäten (z.B. Erfolge, Spielstände).

source: Data deletion
de: Löschung von Daten

# sudokuDataDeletion1
source: Users can delete their account and all associated games data collected by Google through their
de: Nutzer können ihr Konto und alle damit verbundenen Spieldaten, die von Google gesammelt wurden, über ihr

# googlePlayGamesProfile
source: Play Games profile
de: Play Spiele-Profil

source: Google MyAccount
de: Google Konto

# sudokuDataDeletion2
source: or
de: oder

# sudokuDataDeletion4
source: If Google collects Play Games Services data for an individual game, users can delete the data through their
de: Wenn Google Play Games Services-Daten für ein einzelnes Spiel sammelt, können die Nutzer die Daten über ihr

# sudokuStatusPrivacyInformation
source: We review our privacy information on a regular basis. We reserve the right to change the privacy notice at any time with or without notice. Please check back periodically to be notified of any changes. This statement was last updated on 12/19/2022.
de: Wir überprüfen unsere Datenschutzhinweise regelmäßig. Wir behalten uns das Recht vor, die Datenschutzerklärung jederzeit mit oder ohne vorherige Ankündigung zu ändern. Bitte schauen Sie regelmäßig vorbei, um über Änderungen informiert zu werden. Diese Aussage wurde zuletzt am 19.12.2022 aktualisiert.

source: Impressions
de: Impressionen

# lightUtopiaInMemoriamText1
source: This is the last video with the Audi RS3, as it has now been sold...
de: Dies ist das letzte Video mit dem Audi RS3, da er nun verkauft wurde...

# lightUtopiaInMemoriamText2
source: Watch out, kids! This is what marriage does to you...
de: Passt auf, Kinder! Das macht die Ehe mit euch...

# accelerateSubtitle
source: A media project started for fun...
de: Ein Medien-Projekt. Aus Spaß gestartet...
